{"pageProps":{"meta":{"title":"How unusual is this prorogation","date":"2019/09/16"},"content":"<p>The latest prorogation of parliament has come under a <a href=\"https://www.bbc.co.uk/news/uk-politics-49645338\">fair amount of criticism</a>, with some people saying it's a <a href=\"https://www.bbc.co.uk/news/uk-politics-48541352\">cynical attempt to force brexit to occur</a> on October 31st 2019, and others saying it's business as usual.</p>\n<p>So, other than the timing coinciding with the crucial build up to the day the UK is set to leave the EU, how unusual is this compared to historical prorogations? Conveniently, the House of Lords recently released <a href=\"https://researchbriefings.parliament.uk/ResearchBriefing/Summary/LLN-2019-0111#fullreport\">this</a> dataset which should make it pretty easy to work out.</p>\n<h1 id=\"prorogationlengthssince1950\">Prorogation Lengths since 1950</h1>\n<p>The plot below shows the parliamentary session end date on the x axis, and the length it was prorogued for, in days, on the y axis. I've gone with since 1950 as the data looks quite different before then and the politics of over 6 decades ago doesn't feel particularly relevant today. I've also excluded prorogations that were to allow for a general election. When there's a general election, parliament is typically prorogued for a fair bit longer, but there isn't an election this time so it seems reasonable to leave them out.</p>\n<iframe width=\"100%\" height=\"650em\" src=\"/iframes/prorogation_not_election.html\" frameborder=\"0\"></iframe>\n<p>The far right bar is the current prorogation. OK, it's a pretty big bar and certainly the biggest one on there. Here's another way to compare: the average prorogation lengths since 1950, next to this prorogations length:</p>\n<iframe width=\"100%\" height=\"650em\" src=\"/iframes/prorogation_barchart.html\" frameborder=\"0\"></iframe>\n<p>So, that plot shows the current prorogation is a fair chunk bigger than you're average. A bit more than 6 times bigger.</p>\n<h1 id=\"outliers\">Outliers</h1>\n<p>In statistics we often talk about outliers. Outliers are data that lie outside our normal range, and there a bit tricky to define but there are a <a href=\"https://en.wikipedia.org/wiki/Outlier#Definitions_and_detection\">few ways</a>. One I use a fair bit at work is IQR outlier detection, AKA <a href=\"https://en.wikipedia.org/wiki/Outlier#Tukey's_fences\">Tukey's Fences</a>. If we take this definition, the current prorogation is 'far out' as it's more than 3x the IQR from the upper quartile (it's 13.5x away). However, it's a bit tricky and in fairness, there have been other prorogations before this one that were also 'far out', if not this far.</p>\n<p>Another way to think about it is the previous longest prorogation was 20 days, and this one is 33 - making it 65% longer than the longest prorogation since 1950.</p>\n<h1 id=\"conclusion\">Conclusion</h1>\n<p>This progation is unusually long <em>as well as</em> unusually timed.</p>\n<p>🤔</p>\n<p>Fishy.</p>\n<h3 id=\"sources\">Sources</h3>\n<p>You can see how this was calculated and a couple more plots <a href=\"https://github.com/dgmp88/dgmp88.github.io/tree/master/notebook/Prorogation.ipynb\">here</a>.</p>"},"__N_SSG":true}