{"pageProps":{"meta":{"title":"What Expected Value Misses","date":"2022/04/17"},"content":"<h2 id=\"definitions\">Definitions</h2>\n<p>Expected value is the idea how much value does an action have, accounting for the probability of success. For instance, say someone comes to you and offers you two bets:</p>\n<table>\n<thead>\n<tr>\n<th>Bet</th>\n<th>Probability</th>\n<th>Amount</th>\n<th>Calculation</th>\n<th>Expected Value</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>a</td>\n<td>90%</td>\n<td>£1,000,00</td>\n<td>0.9 x £1,000,000</td>\n<td>£900,000</td>\n</tr>\n<tr>\n<td>b</td>\n<td>10%</td>\n<td>£1,000,000,000</td>\n<td>0.1 x £1,000,000,000</td>\n<td>£100,000,000</td>\n</tr>\n</tbody>\n</table>\n<p>You can only pick one, which should you pick? In terms of expected value, option b is far higher.</p>\n<h2 id=\"whatsmissing\">What's missing?</h2>\n<p>However, what would you actually do might depend on a bunch more factors - your personal circumstances, your risk appetite, and how often you get to bet. Say you have average wealth, and you're only offered this bet once. Personally I'd pick option a, as the higher probability of success is more appealing.</p>\n<h2 id=\"reallifeapplicability\">Real life applicability</h2>\n<p>I've been thinking about this in the context of career choices and listening to the <a href=\"https://80000hours.org/\">80,000 hours</a> podcast. They place a strong emphasis on making bets which have high expected value, if only a low chance of success. On a societal level we definitely want people doing this to solve our big problems, but on an individual level I don't think many people can function well on a career path where they honestly believe they have a 90% chance of failure, even if the payoff is potentially huge.</p>\n<p>One mitigation of this might be that I think most people have a hard time really internalising odds. Starting my company I knew the oft touted (if never uncited) stat 9/10 startups fail. But even though I took this to mean my startup would have a high chance of failure, we all tend to think we're special and can beat the odds.</p>"},"__N_SSG":true}