{"pageProps":{"meta":{"title":"The Douchebag Huel Challenge","date":"2024/09/15"},"content":"<p>A buddy and I had a beer and were curious what it'd be like to live off Huel for a week. We set ourselves these goals: </p>\n<ol>\n<li>Only eat Huel </li>\n<li>Don't drink any alcohol</li>\n</ol>\n<p>We were curious on the impact on </p>\n<ul>\n<li>Weight</li>\n<li>Excercise ability </li>\n<li>Poop quality </li>\n<li>Sleep quality</li>\n<li>Energy levels </li>\n<li>Anything else? </li>\n</ul>\n<h2 id=\"whyisthisinteresting\">Why is this interesting?</h2>\n<ol>\n<li>My macros are imperfect, partly as I'm vegetarian - many meals are pretty carb heavy (pasta, pizza, etc). Huel claims to have optimal macros. So with Huel I should <ul>\n<li>Hit protein targets much more frequently.</li>\n<li>Get healthy fats (most of the fat I eat is from cooking oils, a peanut butter addiction, cheese, etc)</li></ul></li>\n<li>My baseline food is reasonably health, but not amazing. I eat out rather a lot (2x lunches, 2-3x dinners a week), which tends to be pretty unhealthy - rich, salty. My default lunch at home is baked beans on toast - OK, but not amazing. My dinners at home are often carb rich (e.g. pasta + vegetables). </li>\n<li>Huel also has lots of micros that I might be somewhat low on (e.g. omega 3's, prevalent in fish, less so in veggie food). </li>\n</ol>\n<h2 id=\"instantfailure\">Instant Failure</h2>\n<p>I failed on 'only eat Huel' on day 1 as my amazing wife brought back some delicious rosette from Italy, so I changed the rules to 'have 2 Huel meals a day'.</p>\n<p><img src='/images/rossette.jpg' /></p>\n<p class=\"text-xs\">Not my rosette, which was mushroom. Image from <a href=\"https://www.tinastable.com/rosette-al-forno/\">Tinas Table</a>. Rosette are amazing, go make them. </p>\n<p>I failed on don't drink alcohol on days 4 and 6 because my social life has a worrying focus on going to pubs.</p>\n<h1 id=\"eventualmethods\">Eventual Methods</h1>\n<p>I mostly went for <a href=\"https://uk.huel.com/products/nav-huel-black-edition\">Huel Black</a>. I tend to buy this as it has more protein. Given my relatively low protein veggie diet, I think makes sense to compensate. </p>\n<p>I had 4 store bought 'ready to drink', which is the default one without extra protein, when I didn't want to carry 2 extra portions to work. </p>\n<p>I had at least 1,000 calories from Huel each day, and often more - e.g. on the first day I had 1,800 calories per day.</p>\n<p>I started on 05/09/2024 and ended 11/09/2024. </p>\n<h1 id=\"results\">Results</h1>\n<h2 id=\"weight\">Weight</h2>\n<p>I gained weight, 68.4 -&gt; 70.8kg. I was surprised by this, I expected to lose it. Hard to say if it's fat or muscle. My weight fluctuates a lot, so I'm not reading much into this. I did feel full more, so it's possible I was just consuming more calories.</p>\n<h2 id=\"exerciseability\">Exercise ability</h2>\n<p>I felt stronger - I squatted heavier than I have for the last 6 months, and had some of my fastest casual runs over the last 6 months. </p>\n<iframe\n  width=\"100%\"\n  height=\"500px\"\n  src=\"/iframes/huel_avg_pace.html\"\n  frameborder=\"0\"\n></iframe>\n<p class=\"text-xs\">Annoying 'mins per kilometer with fractional minutes'. e.g. 5:20 min / km = 5.33 (20s/60s = 0.33). Plotly doesn't handle min/km well.</p>\n<p>There are only 4 data points there, so the boxplot is a tad grandiose. 2 runs were bog standard. But my 2 fastest runs in the last 3 months were during that week. </p>\n<p>They weren't shorter than usual runs too, so I wasn't just doing short sprints. </p>\n<iframe\n  width=\"100%\"\n  height=\"500px\"\n  src=\"/iframes/huel_avg_dist.html\"\n  frameborder=\"0\"\n></iframe>\n<p>I suspect this is a very strong placebo effect, but if it works I don't care. There could be other confounds in here too - e.g. sleeping well the night before, having a couple of easy runs in there.</p>\n<h2 id=\"poopquality\">Poop Quality</h2>\n<h4 id=\"triggerwarningshittalk\">Trigger warning: shit talk</h4>\n<ul>\n<li>I had 2x one wipe wonders. These are very rare for me.</li>\n<li>They seemed darker than usual. Weird. </li>\n<li>No noticeable change to frequency, though I didn't track it.</li>\n</ul>\n<h2 id=\"sleepquality\">Sleep quality</h2>\n<p>I felt like I was sleeping a bit worse the week of the challenge, but similarly the week or two before, so I don't think it was causal. The distribution looks pretty similar. </p>\n<iframe\n  width=\"100%\"\n  height=\"400px\"\n  src=\"/iframes/huel_sleep.html\"\n  frameborder=\"0\"\n></iframe>\n<p class=\"text-xs\">Sleep Score according to Garmin: A number taking into account duration, stress, and phases of sleep.</p>\n<p>The awful nights at the bottom are caused by drinking alcohol that night. This always shows up very strongly on Garmin. </p>\n<h2 id=\"energylevels\">Energy Levels</h2>\n<p>I regret not tracking this better with some kind of check-in score, but I think I felt pretty good most of the week. Not sure really any better/worse than usual though. </p>\n<p>According to Garmin, my 'Body Battery' was within range, but possibly worse than usual.</p>\n<iframe\n  width=\"100%\"\nheight=\"400px\"\n  src=\"/iframes/huel_bb_high.html\"\n  frameborder=\"0\"\n></iframe>\n<p class=\"text-xs\">Body Battery according to Garmin: energy levels estimate, measured using HRV, stress, sleep quality and activity. This is the highest it ever hit for a day in/out of the challenge.</p>\n<iframe\n  width=\"100%\"\nheight=\"400px\"\n  src=\"/iframes/huel_bb_low.html\"\n  frameborder=\"0\"\n></iframe>\n<p class=\"text-xs\">As above, but lowest for a day.</p>\n<p>This could be impacted by running further/faster too, as it does take activity into account.</p>\n<h2 id=\"anythingelse\">Anything else?</h2>\n<h3 id=\"mentalacuity\">Mental acuity</h3>\n<p>I felt reasonably sharp this week, but I'm not sure much change from usual.</p>\n<h3 id=\"stomachfeeling\">Stomach feeling</h3>\n<p>My stomach often felt heavy, in a not-awful but not-pleasant way. Not quite like a big meal, more like there was something sitting in it. I think I'm not used to that much protein.</p>\n<h3 id=\"convenience\">Convenience</h3>\n<p>Not thinking about breakfast / lunch was pretty good. I may have run further than usual at lunch as I knew I could just drink Huel at my desk and not miss more work. </p>\n<h3 id=\"cost\">Cost</h3>\n<p>If at the office I'll spend £8-12 on lunch 2x / week. ~2 Huel portions would be equivalent, which is ~£3.34. </p>\n<p>If at home:\nLunch example: Beans on toast might cost £0.40 beans, £0.38 bagel, £0.35 cheese, then a £0.16 banana  = £1.29\nBreakfast example: Greek yoghurt £0.44, strawberries: £0.62 = £1.06</p>\n<p>So Huel is a bit more expensive. I'm a bit surprised by this.</p>\n<h1 id=\"summary\">Summary</h1>\n<ul>\n<li>I felt stronger, which is likely placebo, but even if it is - still a win! 2 fast runs, 2 strong weights sessions felt great. </li>\n<li>Poops improved.</li>\n<li>Evening meals are a social opportunity with friends and family, and usually the most delicious meal of the day. Very hard to skip, and even if physically healthier they're a joy I don't want to miss out on. Breakfast and lunch I generally care less about, though work lunches are social (and often delicious) too.</li>\n</ul>\n<p>Overall, I think I'll stick to trying to increase my Huel intake - aiming for the majority of breakfasts and lunches.</p>"},"__N_SSG":true}